src/Documents/ЧекКоррекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЧекКоррекции</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоррекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассирИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Comment>Кассовая смена</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеприменениеККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПредписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоррекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупательEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупательИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупательНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоррекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Comment>Признак сторнирующего документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОплатыККТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПозицииЧека</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаТелефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПредметаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАгентаПоПредметуРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакПредметаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСпособаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиСпособаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСоСкидками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОснований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аванс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторФискальнойЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяПостоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СпособыФорматноЛогическогоКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыФорматноЛогическогоКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазделятьСтроки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачитыватьСуммы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыРасчетаДенежнымиСредствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаДенежнымиСредствами</Name>
			<Comment>Типы расчета денежными средствами для кассового чека</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредств</Name>
					<Comment>Чек продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредств</Name>
					<Comment>Чек возврата продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредств</Name>
					<Comment>Чек покупки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРасходаДенежныхСредств</Name>
					<Comment>Чек возврата покупки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЧекКоррекции/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

// Процедура - Обработка получения полей представления
//
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
    Поля.Добавить("ЭтоСторно");
	Поля.Добавить("Ссылка");
	
КонецПроцедуры   

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает данные для пробития чека коррекции.
//
Функция ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции, Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
		
	МассивДокументовОплаты = Новый Массив;
	МассивДокументовОплаты.Добавить(ЧекКоррекции.Ссылка);
	
	// Общие параметры чека
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Касса");
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("Покупатель");
	СтруктураРеквизитов.Вставить("ПокупательEmail");
	СтруктураРеквизитов.Вставить("ПокупательНомер");
	СтруктураРеквизитов.Вставить("Дата");
	СтруктураРеквизитов.Вставить("СистемаНалогообложения");
	СтруктураРеквизитов.Вставить("ТипРасчета");
	СтруктураРеквизитов.Вставить("ТипКоррекции");
	СтруктураРеквизитов.Вставить("ОписаниеКоррекции");
	СтруктураРеквизитов.Вставить("ДатаКоррекции");
	СтруктураРеквизитов.Вставить("НомерПредписания");
	СтруктураРеквизитов.Вставить("НеприменениеККТ");
	//СтруктураРеквизитов.Вставить("ДокументОснование");
	СтруктураРеквизитов.Вставить("ПробитЧек");
	СтруктураРеквизитов.Вставить("Кассир");
	СтруктураРеквизитов.Вставить("КассирИНН");
	СтруктураРеквизитов.Вставить("ДополнительныйРеквизит");
	СтруктураРеквизитов.Вставить("СтруктурнаяЕдиница");
	СтруктураРеквизитов.Вставить("ВидОперации");
	//СтруктураРеквизитов.Вставить("ВидНалога");
	СтруктураРеквизитов.Вставить("АвторДокумента");
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЧекКоррекции, СтруктураРеквизитов);
	
	Если РеквизитыДокумента.ПробитЧек Тогда
		ТекстСообщения = НСтр("ru = '%1 уже пробит'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЧекКоррекции);
		Возврат Новый Структура("Результат, ОписаниеОшибки", Ложь, ТекстСообщения);
	КонецЕсли;    

	ПараметрыЧека = МенеджерОборудованияВызовСервера.ПустаяСтруктураПараметровЧекаКоррекции();
	
	ПараметрыЧека.ВидОперации             = РеквизитыДокумента.ВидОперации;
	ПараметрыЧека.СтруктурнаяЕдиница      = РеквизитыДокумента.СтруктурнаяЕдиница;
	ПараметрыЧека.Организация             = РеквизитыДокумента.Организация;
	ПараметрыЧека.Сотрудник               = РеквизитыДокумента.АвторДокумента;
	ПараметрыЧека.Клиент                  = РеквизитыДокумента.Покупатель;
	ПараметрыЧека.Дата                    = ТекущаяДатаСеанса();
	ПараметрыЧека.Касса                   = РеквизитыДокумента.Касса;
	//ПараметрыЧека.Кассир				  = РеквизитыДокумента.Кассир;
	//ПараметрыЧека.КассирИНН				  = РеквизитыДокумента.КассирИНН;
	ПараметрыЧека.Количество              = 1;		
	ПараметрыЧека.СуммаОплачено           = ЧекКоррекции.Оплата.Итог("Сумма");//СтруктураРеквизитов.СуммаДокумента;
	ПараметрыЧека.СуммаКОплате 			  = ЧекКоррекции.Оплата.Итог("Сумма");
	ПараметрыЧека.ВидНалога               = РеквизитыДокумента.СистемаНалогообложения; 
	ПараметрыЧека.ТипЧека                 = ПолучитьКодТипаРасчетаДенежнымиСредствами(РеквизитыДокумента.ТипРасчета);
	
	ПараметрыЧека.ВыводитьЧекНаБумагу     = ?(Параметры.Свойство("ВыводитьЧекНаБумагу"), Параметры.ВыводитьЧекНаБумагу, Истина);
	ПараметрыЧека.ЭлектроннаяПочтаКлиента = ?(Параметры.Свойство("ЭлектроннаяПочтаКлиента"), Параметры.ЭлектроннаяПочтаКлиента, РеквизитыДокумента.ПокупательEmail); //ПочтаКлиента;
	ПараметрыЧека.НомерТелефонаКлиента    = ?(Параметры.Свойство("НомерТелефонаКлиента"), Параметры.НомерТелефонаКлиента, РеквизитыДокумента.ПокупательНомер); //ТелефонКлиента;
	
	ПараметрыЧека.КорректируемыйДокумент				= ОбщегоНазначенияСтоматология.ПреобразоватьТЗвМассивСтруктуры(ЧекКоррекции.ТаблицаОснований.Выгрузить());
	ПараметрыЧека.ДанныеКоррекции.ТипКоррекции			= РеквизитыДокумента.ТипКоррекции;
	ПараметрыЧека.ДанныеКоррекции.ОписаниеКоррекции		= РеквизитыДокумента.ОписаниеКоррекции;
	ПараметрыЧека.ДанныеКоррекции.ДатаКоррекции			= РеквизитыДокумента.ДатаКоррекции;
	ПараметрыЧека.ДанныеКоррекции.НомерПредписания		= РеквизитыДокумента.НомерПредписания;
	ПараметрыЧека.НеприменениеККТ 						= РеквизитыДокумента.НеприменениеККТ;
	ПараметрыЧека.МассивДокументовОснований				= МассивДокументовОплаты;
	ПараметрыЧека.СформироватьЧекКоррекции				= Истина;
	ПараметрыЧека.ДополнительныйРеквизит				= РеквизитыДокумента.ДополнительныйРеквизит;
	
	//----------
	РезультатОперации  = Новый Структура("Результат, ОписаниеОшибки", Истина, Неопределено);
	
	Касса				= ?(РеквизитыДокумента.Свойство("Касса"), РеквизитыДокумента.Касса, Неопределено);
	ПроизошлоИсключение	= Ложь;

	Если Касса = Неопределено Тогда		
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Для данной операции необходимо указать кассу!'; en = 'For this operation, you must specify the cashbox!'");
		Возврат РезультатОперации;		
	КонецЕсли;
	
	// Если в кассе не используется оборудование отменить операцию.
	Если Касса.ИспользоватьБезПодключенияОборудования Тогда
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Касса: %1 используется без подключения оборудования!';en= 'Cashbox: %1 is used without connecting equipment!'"), Касса);
		Возврат РезультатОперации;
	КонецЕсли;		
	
	// Получаем общие параметры для пробития чека коррекции на ФР (ФИКСИРОВАННАЯ СТРУКТУРА).
	ОбщиеПараметры = МенеджерОборудованияВызовСервера.ПолучитьОбщиеПараметрыПробитияЧекаКоррекции(ПараметрыЧека);  	
	
	// Копируем основные параметры чека.
	ФискальныйЧек = Новый Структура(ОбщиеПараметры);
	ФискальныйЧек.ПозицииЧека  = Новый Массив;
	ФискальныйЧек.ТаблицаОплат = Новый Массив;
	
	ДобавитьТоварыВОбщиеПараметрыЧека(ФискальныйЧек, ЧекКоррекции.ПозицииЧека);
	ДобавитьОплатуВОбщиеПараметрыЧека(ФискальныйЧек, ЧекКоррекции.Оплата);		
	
	Если ЗначениеЗаполнено(ФискальныйЧек.Касса.ВнешнееОборудование) Тогда 
		РеквизитыОборудования = ФорматноЛогическийКонтрольВызовСервера.СтруктураДанныхФорматноЛогическогоКонтроля(ФискальныйЧек.Касса.ВнешнееОборудование);
		ФискальныйЧек.СпособФорматноЛогическогоКонтроля					= РеквизитыОборудования.СпособФорматноЛогическогоКонтроля;
		ФискальныйЧек.ДопустимоеРасхождениеФорматноЛогическогоКонтроля	= РеквизитыОборудования.ДопустимоеРасхождениеФорматноЛогическогоКонтроля;
	Иначе
		ФискальныйЧек.СпособФорматноЛогическогоКонтроля = Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки;
	КонецЕсли;
	
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ФискальныйЧек, ФискальныйЧек.Касса.ВнешнееОборудование);
	
	РезультатОперации.Вставить("ФискальныйЧек", ФискальныйЧек);

	Возврат РезультатОперации;
	
КонецФункции

// Получить код типа расчета денежными средствами.
// 
Функция ПолучитьКодТипаРасчетаДенежнымиСредствами(ТипРасчета) 
	
	Если ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств") Тогда
		ПризнакРасчетаКод = 0 
	ИначеЕсли ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств") Тогда
		ПризнакРасчетаКод = 1 
	ИначеЕсли ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств") Тогда
		ПризнакРасчетаКод = 2
	ИначеЕсли ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств") Тогда
		ПризнакРасчетаКод = 3
	КонецЕсли;
	
	Возврат ПризнакРасчетаКод;
	
КонецФункции        

// Процедура добавляет оплату в общие параметры чека.
//
Процедура ДобавитьОплатуВОбщиеПараметрыЧека(ОбщиеПараметры, МассивОплат)
	
	Для Каждого СтрокаМ ИЗ МассивОплат Цикл							
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", МенеджерОборудованияВызовСервера.ПолучитьТипОплатыПоТипуДенежныхСредств(Истина, СтрокаМ.ТипОплаты));
		СтрокаОплаты.Вставить("Сумма"    , СтрокаМ.Сумма);
		
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);			
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет товары в общие параметры чека.
//
Процедура ДобавитьТоварыВОбщиеПараметрыЧека(ОбщиеПараметры, ПозицииЧека)
	
	Для Каждого СтрокаМ Из ПозицииЧека Цикл		
				
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, СтрокаМ);	
		
		Если ТипЗнч(СтрокаМ.НаименованиеПредметаРасчета) = Тип("Строка") Тогда
			СтрокаПозицииЧека.Наименование     = СтрокаМ.НаименованиеПредметаРасчета;
		Иначе
			СтрокаПозицииЧека.Наименование     = Справочники.Номенклатура.ПолучитьНаименованиеДляЧека(СтрокаМ.НаименованиеПредметаРасчета);
		КонецЕсли;
		СтрокаПозицииЧека.Сумма            = СтрокаМ.СуммаСоСкидками;
		
		СтрокаПозицииЧека.СтавкаНДС        = ПолучитьСтавкуНДСККТ(СтрокаМ.СтавкаНДС);  		
		СтрокаПозицииЧека.Штрихкод         = СтрокаМ.Штрихкод;	
		СтрокаПозицииЧека.НомерСекции      = СтрокаМ.НомерСекции;	
		
		СтрокаПозицииЧека.ДанныеПоставщика.ИНН					= СтрокаМ.ДанныеПоставщикаИНН;		
		СтрокаПозицииЧека.ДанныеПоставщика.Наименование 		= СтрокаМ.ДанныеПоставщикаНаименование;
		СтрокаПозицииЧека.ДанныеПоставщика.Телефон				= СтрокаМ.ДанныеПоставщикаТелефон;
		
		Если Не ЗначениеЗаполнено(СтрокаМ.ПризнакАгентаПоПредметуРасчета) Тогда
			СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = Неопределено;
		КонецЕсли;
		
		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);			

	КонецЦикла;      
	
КонецПроцедуры

// Функция, возвращает ставку НДС для ККТ.
//
Функция ПолучитьСтавкуНДСККТ(СтавкаНДС)
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС)
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		 
		 Возврат Неопределено;
	 Иначе
		 СоответствиеСтавокНДС = Новый Соответствие;
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС0 , 0);
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС10, 10);
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС18, 18);
		 СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС20, 20);
		 
		Возврат СоответствиеСтавокНДС.Получить(СтавкаНДС);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
